print("2+3*4 =", 2+3*4) #14
print("(2+3)*4 =", (2+3)*4) #20
print("2+3*4//2%4-1 =", 2+3*4//2%4-1) #3
print("6/2*3 =", 6/2*3) #9.0
print("6/(2*3) =", 6/(2*3)) #1.0
print("2**3**2 =", 2**3**2) #512
print("(2**3)**2 =", (2**3)**2) #64
print("-2*-4 =", -2*-4) #8
print("-2**4 =", -2**4) #-16
print("(-2)**4 =", (-2)**4) #16

#อยากทราบว่า นับจากเวลาบ่ายโมง 13:00:00 ไปอีก 98789 วินาที จะเป็นเวลาอะไร ให้เขียนคำสั่งคำนวณและแสดงผล ในรูปแบบ HH:MM:SS
h = 13
m = 0
s = 0

t = h*3600 + m*60 + s
t += 98789
h = t//3600 % 24
m = t % 3600 // 60
s = t % 60

print(str(h)+":"+str(m)+":"+str(s))
