# อ่านสตริงจาก input เก็บใน x
# สตริงที่อ่านมามีรูปแบบ h:m:s แทน
#   ชั่วโมง:นาที:วินาที
#   เช่น 10:30:00 หรือ 8:30:15
# ให้สร้างตัวแปร 3 ตัว h, m และ s
#   ที่เก็บจำนวนเต็มของชั่วโมง นาที
#   และวินาที่ตามลำดับ
#
x = input()
a = x.split(":")
h = int(a[0])
m = int(a[1])
s = int(a[2])
print(h,m,s)

# อ่านสตริงจาก input เก็บใน x
# สตริงที่อ่านมามีรูปแบบจำนวนเต็ม 4 จำนวน  
# โดยจำนวนเต็มทั้งสี่ถูกคั่นด้วย , และช่องว่าง
#   เช่น 24, 35, 43, 67
# จงแสดงค่าเฉลี่ยของจำนวนที่อ่านเข้ามา
#
x = input().split(", ")
sum = int(x[0]) + int(x[1]) + int(x[2]) + int(x[3])
print(sum/4)

# อ่านสตริงจาก input ที่มีรูปแบบ  
# รหัสนักศึกษา: คะแนน, คะแนน, คะแนน
#   เช่น 10232: 20, 30.5, 15.8
#
# เก็บสตริงรหัสนักศึกษาใน student_id
# เก็บคำนวนคะแนนเฉลี่ยใน average_point
#
s = input().split(":")
student_id = (s[0])
a = s[1].split(", ")
p1 = float(a[0])
p2 = float(a[1])
p3 = float(a[2])
total = p1 + p2 + p3
average_point = total / 3
